; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v3)
             (pred_1 ?v11 ?v1)
             (pred_12 ?v8 ?v1)
             (pred_10 ?v9 ?v8 )
	     (pred_5 ?v8)
             (pred_8 ?v12)
             (pred_3 ?v11)
             (pred_6 ?v1)
             (pred_11 ?v8)
             (pred_9 ?v11)
             (pred_7 ?v8)
             (pred_4 ))



(:action op_2
:parameters (?v13 ?v10 ?v6 ?v4)
:precondition (and (pred_8 ?v13) (pred_8 ?v10) (pred_3 ?v6) (pred_6 ?v4)
          (pred_2 ?v13 ?v10) (pred_1 ?v6 ?v4)
                   (pred_12 ?v10 ?v4) (pred_5 ?v13) 
                   (pred_11 ?v10) (pred_9 ?v6))
:effect (and  (pred_7 ?v10) (not (pred_11 ?v10))))


(:action op_5
:parameters (?v13 ?v7)
:precondition (and (pred_8 ?v13) (pred_8 ?v7)
               (pred_5 ?v13) (pred_2 ?v13 ?v7) (pred_7 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v13))))

(:action op_1
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_3 ?v6) 
                  (pred_5 ?v13) (pred_10 ?v6 ?v13) (pred_4 ))
:effect (and (pred_9 ?v6)
   (not (pred_10 ?v6 ?v13)) (not (pred_4 ))))


(:action op_3
:parameters (?v13 ?v2 ?v5)
:precondition (and (pred_8 ?v13) (pred_3 ?v2) (pred_3 ?v5)
                  (pred_5 ?v13) (pred_9 ?v5) (pred_10 ?v2 ?v13))
:effect (and (pred_9 ?v2) (pred_10 ?v5 ?v13)
        (not (pred_9 ?v5)) (not (pred_10 ?v2 ?v13))))

(:action op_4
:parameters (?v13 ?v6)
:precondition (and (pred_8 ?v13) (pred_3 ?v6) 
                  (pred_5 ?v13) (pred_9 ?v6))
:effect (and (pred_4 ) (pred_10 ?v6 ?v13) (not (pred_9 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_28 obj_31 obj_18 obj_17 obj_30 obj_26 obj_14 obj_22 obj_08 obj_21 obj_23 obj_11 obj_01 obj_15 obj_02 obj_19 obj_13 obj_06 obj_29 obj_10 obj_05 obj_25 obj_16 obj_04
    obj_12 obj_27 obj_09
    obj_20 obj_03 obj_07
    )

    (:init
       (pred_4)

       (pred_8 obj_24)
       (pred_8 obj_28)
       (pred_8 obj_31)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_8 obj_30)
       (pred_8 obj_26)
       (pred_8 obj_14)
       (pred_8 obj_22)
       (pred_8 obj_08)
       (pred_8 obj_21)
       (pred_8 obj_23)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_02)
       (pred_8 obj_19)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_29)
       (pred_8 obj_10)
       (pred_8 obj_05)
       (pred_8 obj_25)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_27)
       (pred_6 obj_09)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_07)

       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_28)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_28 obj_31)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_31 obj_14)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_31 obj_28)
       (pred_2 obj_18 obj_22)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_31)
       (pred_2 obj_17 obj_08)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_30 obj_21)
       (pred_2 obj_30 obj_26)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_26 obj_23)
       (pred_2 obj_26 obj_14)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_26 obj_30)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_22)
       (pred_2 obj_14 obj_31)
       (pred_2 obj_14 obj_26)
       (pred_2 obj_22 obj_01)
       (pred_2 obj_22 obj_08)
       (pred_2 obj_22 obj_18)
       (pred_2 obj_22 obj_14)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_17)
       (pred_2 obj_08 obj_22)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_21 obj_23)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_23 obj_19)
       (pred_2 obj_23 obj_11)
       (pred_2 obj_23 obj_26)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_01)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_11 obj_23)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_01 obj_15)
       (pred_2 obj_01 obj_22)
       (pred_2 obj_01 obj_11)
       (pred_2 obj_15 obj_29)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_01)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_19 obj_23)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_11)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_06 obj_29)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_29 obj_04)
       (pred_2 obj_29 obj_15)
       (pred_2 obj_29 obj_06)
       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_05 obj_25)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_25 obj_16)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_05)
       (pred_2 obj_16 obj_04)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_25)
       (pred_2 obj_04 obj_29)
       (pred_2 obj_04 obj_16)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_31)
       (pred_12  obj_11 obj_12)
       (pred_12  obj_17 obj_27)
       (pred_12  obj_31 obj_09)
       (pred_7 obj_24)
       (pred_7 obj_28)
       (pred_7 obj_18)
       (pred_7 obj_30)
       (pred_7 obj_26)
       (pred_7 obj_14)
       (pred_7 obj_22)
       (pred_7 obj_08)
       (pred_7 obj_21)
       (pred_7 obj_23)
       (pred_7 obj_01)
       (pred_7 obj_15)
       (pred_7 obj_02)
       (pred_7 obj_19)
       (pred_7 obj_13)
       (pred_7 obj_06)
       (pred_7 obj_29)
       (pred_7 obj_10)
       (pred_7 obj_05)
       (pred_7 obj_25)
       (pred_7 obj_16)
       (pred_7 obj_04)

       (pred_1  obj_20 obj_12)
       (pred_1  obj_03 obj_27)
       (pred_1  obj_07 obj_09)
       (pred_10 obj_20 obj_13)
       (pred_10 obj_03 obj_16)
       (pred_10 obj_07 obj_22)
       (pred_5 obj_24)
    )

    (:goal (and
       (pred_10 obj_20 obj_04)
       (pred_10 obj_03 obj_28)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_5 obj_24 obj_28)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_28)
   goals met: 0 of 2
2. (op_5 obj_28 obj_26)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_26)
   goals met: 0 of 2
3. (op_5 obj_26 obj_23)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_23)
   goals met: 0 of 2
4. (op_5 obj_23 obj_19)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_19)
   goals met: 0 of 2
5. (op_5 obj_19 obj_13)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_13)
   goals met: 0 of 2
6. (op_1 obj_13 obj_20)
   deleted: (pred_10 obj_20 obj_13) (pred_4)
   added: (pred_9 obj_20)
   goals met: 0 of 2
7. (op_5 obj_13 obj_25)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_25)
   goals met: 0 of 2
8. (op_5 obj_25 obj_16)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_16)
   goals met: 0 of 2
9. (op_5 obj_16 obj_04)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_20)
   deleted: (pred_9 obj_20)
   added: (pred_4) (pred_10 obj_20 obj_04)
   goals met: 1 of 2
11. (op_5 obj_04 obj_16)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_16)
   goals met: 1 of 2
12. (op_1 obj_16 obj_03)
   deleted: (pred_10 obj_03 obj_16) (pred_4)
   added: (pred_9 obj_03)
   goals met: 1 of 2
13. (op_5 obj_16 obj_25)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_25)
   goals met: 1 of 2
14. (op_5 obj_25 obj_13)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_13)
   goals met: 1 of 2
15. (op_5 obj_13 obj_19)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_19)
   goals met: 1 of 2
16. (op_5 obj_19 obj_23)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_23)
   goals met: 1 of 2
17. (op_5 obj_23 obj_26)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_26)
   goals met: 1 of 2
18. (op_5 obj_26 obj_28)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_28)
   goals met: 1 of 2
19. (op_4 obj_28 obj_03)
   deleted: (pred_9 obj_03)
   added: (pred_4) (pred_10 obj_03 obj_28)
   goals met: 2 of 2
